Revit 2015 API
FormatValueOptions Members
The FormatValueOptions type exposes the following members.
Constructors
Name | Description
FormatValueOptions
 Creates a new FormatValueOptions object with default settings.
Methods
Name | Description
AreValidForUnitType |  Obsolete.
 Checks whether the FormatOptions in this FormatValueOptions is valid for a given unit type.
Dispose
Releases all resources used by the FormatValueOptions
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetFormatOptions
 Gets the FormatOptions to optionally override the default settings in the Units class.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
SetFormatOptions
 Sets the FormatOptions to optionally override the default settings in the Units class.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
AppendUnitSymbol
 Indicates if a unit symbol should be appended regardless of the settings in the FormatOptions.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
FormatValueOptions Class
Autodesk.Revit.DB Namespace